[
    {
        "company": "Amazon.com, Inc",
        "description": "Worked as part of an internal team in the Alexa Organization. Developed an email reminder system that followed up with developers on a consistent basis to update outdated feature launch status information. System was developed using Java and utilized various AWS technologies. Emails were generated using Apache Velocity template engine.",
        "bullets": [
            "Designed and implemented reminder system that ensures thousands of feature launch statuses are up to date by alerting developers of outdated data on a weekly cadence, saving the Project Management team hours of manual labor a week.",
            "Reminder system aggregates all outdated data into a single spreadsheet and persists it to Amazon S3 for consumption by the Project Management team.",
            "Provided an economic and scalable solution by utilizing Step Functions, Lambdas and other serverless AWS technologies.",
            "Presented project design to senior engineers and stakeholders for their sign off on implementation strategy and fulfillment of requirements."
        ],
        "skillsGained": [
            "AWS",
            "Java",
            "Unit & Integration Testing",
            "Collaboration",
            "SQL",
            "Linux",
            "Agile",
            "Communication",
            "Documentation",
            "Leadership",
            "Git"
        ],
        "position": "Software Engineering Intern",
        "startDate": "June 2019",
        "endDate": "August 2019",
        "location": "Seattle, WA",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": true
    },
    {
        "company": "Rutgers University",
        "description": "Worked as part of cross-functional team for the Office of Information Technology at Rutgers University. Core responsibilites included lab maintenance, lab device troubleshooting and excellent customer service. Received ResNet Dispatch training which served as qualification to troubleshoot patron devices and residential networks in student housing. ",
        "bullets": [
            "Worked alongside supervisors and fellow consultants to provide excellent customer service to lab patrons.",
            "Received training to assist patrons in troubleshooting and configuring devices in accordance with Rutgers University network and usage policies.",
            "Diagnosed, troubleshooted and resolved a variety of network-related issues for thousands of students campus-wide."
        ],
        "skillsGained": [
            "Troubleshooting",
            "Customer Service",
            "Collaboration",
            "Communication"
        ],
        "position": "OIT Residential Network Consultant",
        "startDate": "August 2018",
        "endDate": "Present",
        "location": "Piscataway, NJ",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": true
    },
    {
        "company": "",
        "description": "Instructed students in software development concepts including basic algorithms, object-oriented programming and data structures. Advised on career hunts, project ideas, relevant technologies and resources to take advantage of to develop deeper understanding of the field.",
        "bullets": [
            "Conducted one on one tutoring sessions for multiple students in order to increase competency in fundamental software development concepts and succeed in intense computer science courses, resulting in an average increase of one letter grade.",
            "Advised students on new technologies to explore, projects to work on, resources to utilize and techniques to prepare for upcoming interviews.",
            "Critiqued resumes to help underclassmen properly showcase their talent and abilities to potential employers, with an 80% success rate of receiving internship offers."
        ],
        "skillsGained": [
            "Teaching",
            "Analysis",
            "Java",
            "Problem Solving",
            "Mentorship",
            "Communication"
        ],
        "position": "Software Development Mentor",
        "startDate": "September 2017",
        "endDate": "Present",
        "location": "Piscataway, NJ",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": true
    },
    {
        "company": "Raritan Inc.",
        "description": "Worked alongside team of IT professionals to improve staff productivity by troubleshooting, maintaining and upgrading corporate hardware and software in accordance with company policy.",
        "bullets": [
            "Tested and upgraded over 70% of corporate software and devices to increase work efficiency for all staff.",
            "Resolved technical difficulties quickly and thoroughly for all staff to prevent further delays in productivity."
        ],
        "skillsGained": [
            "Collaboration",
            "Troubleshooting",
            "Communication"
        ],
        "position": "IT Summer Intern",
        "startDate": "June 2018",
        "endDate": "August 2018",
        "location": "location",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": false
    },
    {
        "company": "Best Buy",
        "description": "Worked as part of Best Buy sales staff to assist customers in making informed purchases. Received training to ensure understanding of technical specifications and use cases of devices was met corporate standards.",
        "bullets": [
            "Provided exceptional customer service to clients by assessing their computer- and network-related needs in order to assist them in making informed purchases.",
            "Tracked product inventory and organized products to drive up sales."
        ],
        "skillsGained": [
            "Sales",
            "Communication",
            "Collaboration"
        ],
        "position": "Computer Sales Associate",
        "startDate": "June 2017",
        "endDate": "December 2017",
        "location": "Iselin, NJ",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": false
    },
    {
        "company": "Rutgers University",
        "description": "Worked as part of IT team to prepare and repair facility devices by reimaging hard drives and replacing hardware components and assuring computers met facility standards.",
        "bullets": [
            "Imaged hard drives and performed low-level formats on flash drives and minor hardware repairs on facility computers.",
            "Assured computers were up to date to meet facility software standards and tested them for optimal performance."
        ],
        "skillsGained": [
            "Troubleshooting",
            "Collaboration",
            "Communication"
        ],
        "position": "Student Help Desk Assistant",
        "startDate": "September 2016",
        "endDate": "May 2017",
        "location": "Piscataway, NJ",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": false
    },
    {
        "company": "Young Muslims",
        "description": "Work closely with members nationwide in order to coordinate and document conversations with prior national-council leaderships to understand the decisions made to grow the organization to where it is today.",
        "bullets": [
            "Coordinate conversations with prior national-counil leaderships in order to develop a deeper understanding of the issues, discussions and decisions of their terms that helped shape the course of the organization",
            "Document conversations to be used as a point of reference for current and future leadership in order to assist in making future decisions or appeals."
        ],
        "skillsGained": [
            "Collaboration",
            "Communication",
            "Leadership",
            "Management",
            "Project Management",
            "Problem Solving",
            "Decision Making",
            "Analysis",
            "Mentorship",
            "Delegation"
        ],
        "position": "Research Team Member",
        "startDate": "February 2020",
        "endDate": "Present",
        "location": "NJ",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": false
    },
    {
        "company": "Young Muslims",
        "description": "Work alongside seasoned leadership to establish quality control framework in order to maintain consistency and quality of local chapters, regional events and leadership development.",
        "bullets": [
            "Established team of experienced and qualified leadership to spearhead quality control and development efforts in the region.",
            "Visit different chapters on a weekly basis with other members of the Quality Control team in order to assess operational status and quality of leadership.",
            "Discuss strategies to improve local chapter meetings and leadership development.",
            "Advise local leadership on strengths, weaknesses and strategies to grow local chapter or improve events",
            "Organize leadership training and development workshops to pipeline leadership into various roles in the organization on local, regional and national levels."
        ],
        "skillsGained": [
            "Collaboration",
            "Communication",
            "Leadership",
            "Management",
            "Project Management",
            "Problem Solving",
            "Decision Making",
            "Analysis",
            "Mentorship",
            "Delegation"
        ],
        "position": "Quality Control Coordinator",
        "startDate": "October 2019",
        "endDate": "Present",
        "location": "NJ",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": false
    },
    {
        "company": "Young Muslims",
        "description": "Served as logistics lead for a national sub-conference that caters to the youth of America.",
        "bullets": [
            "Worked with sophisticated team in order to organize logistics for national conference that caters to over 5,000 attendees.",
            "Developed crowd control strategies to handle large influx of attendees during keynote sessions.",
            "Organized and implemented fundraising plan of attack in order to raise thousands of dollars in donations for the organization."
        ],
        "skillsGained": [
            "Collaboration",
            "Communication",
            "Leadership",
            "Management",
            "Project Management",
            "Problem Solving",
            "Decision Making",
            "Analysis",
            "Delegation"
        ],
        "position": "Logistics chair",
        "startDate": "December 2017",
        "endDate": "December 2018",
        "location": "NJ",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": false
    },
    {
        "company": "Young Muslims",
        "description": "Coordinated team of cross-functional leaders to facilitate regional events and maintain and grow individual chapters through weekly status updates and quality control.",
        "bullets": [
            "Facilitated the community and leadership development of northern New Jersey through community events, meetings and leadership development workshops.",
            "Worked closely with struggling chapters to motivate and reinvigorate its leadership.",
            "Spearheaded discussions amongst leadership regarding community growth, chapter issues and burnout-prevention."
        ],
        "skillsGained": [
            "Collaboration",
            "Communication",
            "Leadership",
            "Management",
            "Project Management",
            "Problem Solving",
            "Decision Making",
            "Analysis",
            "Mentorship",
            "Delegation"
        ],
        "position": "Regional Coordinator",
        "startDate": "December 2017",
        "endDate": "December 2018",
        "location": "NJ",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": true
    },
    {
        "company": "Young Muslims",
        "description": "Managed team of 4-5 to coordinate weekly meetings and events for local youth group and provide a platform for mentorship and communal growth.",
        "bullets": [
            "Mentored team of high school students to develop effective and motivated individuals that strive to grow its community.",
            "Planned weekly meetings and events tailored to building today’s youth into tomorrow’s leaders.",
            "Devised metrics that served as the backbone for improvement on meeting quality.",
            "Streamlined process for chapter logistics by assigning and rotating roles between team members in order to prevent burnout caused by redundant and mundane tasks."
        ],
        "skillsGained": [
            "Collaboration",
            "Communication",
            "Leadership",
            "Management",
            "Project Management",
            "Problem Solving",
            "Decision Making",
            "Analysis",
            "Mentorship",
            "Delegation"
        ],
        "position": "Chapter Coordinator",
        "startDate": "January 2016",
        "endDate": "January 2017",
        "location": "Old Bridge, NJ",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": false
    },
    {
        "company": "MIST",
        "description": "Spearheaded high-school recruitment efforts to increase number of competitors in annual tournament. Students were able to compete in sports, spoken word, art and other secular and religious categories.",
        "bullets": [
            "Coordinated recruitment events among various high schools throughout New Jersey.",
            "Ensured tournament organizers are well-equipped with presentation skills to promote the organization effectively.",
            "Facilitated conversations for partnership between two national organizations YM and MIST on a regional level."
        ],
        "skillsGained": [
            "Collaboration",
            "Communication",
            "Leadership",
            "Management",
            "Problem Solving",
            "Decision Making",
            "Analysis",
            "Mentorship",
            "Delegation"
        ],
        "position": "Recruitment Chair",
        "startDate": "January 2016",
        "endDate": "January 2017",
        "location": "NJ",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": false
    },
    {
        "company": "Sayreville EMS",
        "description": "Received CPR and EMT certifications in the state of New Jersey to volunteer for local emergency squad and give back to the community.",
        "bullets": [
            "Provided excellent patient care while consoling them and their families.",
            "Came up with solutions in unique situations where typical equipment would not suffice.",
            "Received CPR and EMT certifications after a rigorous training class that spanned over three months."
        ],
        "skillsGained": [
            "Customer Service",
            "Analysis",
            "Patient Care",
            "Collaboration"
        ],
        "position": "Volunteer EMT",
        "startDate": "August 2015",
        "endDate": "April 2017",
        "location": "Sayreville, NJ",
        "takeAway": "Software Development is not just programming, it's building readable, maintainable and extensible code",
        "relevant": false
    }
]